app/Controllers/Element.php

    public function viewList(){
        return $this->respond(['elements'=>  $this->elementModel->findAll()], 200);
---
SELECT *
FROM `elements`