app/Controllers/Login.php

    public function index()
    {
        $userModel = new UserModel();
        $email = $this->request->getVar('User_correo');
        $password = $this->request->getVar('User_password');
        $user = $userModel->where('User_correo', $email)->first();
---
SELECT *
FROM `users`
WHERE `User_correo` = 'wamoreno57@gmail.com'
 LIMIT 1