app/Controllers/User.php

    public function viewList(){
        return $this->respond(['users'=>  $this->userModel->findAll()], 200);
---
SELECT *
FROM `users`

    public function create()
    {
            $data =[
                'User_id' => $this->request->getVar('User_id'),
                'User_documento' => $this->request->getVar('User_documento'),
                'User_nombre' => $this->request->getVar('User_nombre'),
                'User_apellido_paterno' => $this->request->getVar('User_apellido_paterno'),
                'User_apellido_materno' => $this->request->getVar('User_apellido_materno'),
                'User_telefono' => $this->request->getVar('User_telefono'),
                'User_correo' => $this->request->getVar('User_correo'),
                'User_password' => password_hash($this->request->getVar('User_password'),PASSWORD_DEFAULT),
                'City_fk' => $this->request->getVar('City_fk'),
                'Area_fk' => $this->request->getVar('Area_fk'),
                'Roles_fk' => $this->request->getVar('Roles_fk'),
                'User_status_fk' => $this->request->getVar('User_status_fk'),
                'update_at' => $this->request->getVar('update_at'),
            ];
            if($this->userModel->insert($data)){
                $data['message']= 'success';
                $data['response']= ResponseInterface::HTTP_OK;
                $data['data']=  $data ;
                $data['csrf']= csrf_hash();
            }else{
                $data['message'] = 'Error create user';
                $data['response'] = ResponseInterface::HTTP_NO_CONTENT;
                $data['data'] = '';
            }

        return $this->respond(['users'=>  $this->userModel->findAll()], 200);
---
SELECT *
FROM `users`

    public function singleUser($id = null)
    {

            if($data['data'] = $this->userModel->where($this->primarykey, $id)->first()){
---
SELECT *
FROM `users`
WHERE `User_id` = '3'
 LIMIT 1

    public function delete($id = null)
    {
        if($this->userModel->where($this->primarykey, $id)->delete($id)){
---
DELETE FROM `users`
WHERE `User_id` = '11'
AND `User_id` IN ('11')